import door from './img/door.jpg';
import number from './img/number.jpg';
import coin from './img/coin.jpg';

export const games = [
    {   
        
        door,
        id: '5ee119a8door',
        gameName: 'Вгадай двері',
        description: 'Кожен раз коли ви клікаєте по одній з дверей, з вашого балансу списується 5% від вашого початкового депозиту, программа генерує випадкове значення від 1 до 3,  якщо ваш варіaнт співпав з тим який згенерувала программа, то ви потроїте ставку, якщо ні то втрачаєте списані кошти з балансу.',
        img: door,
        path: "/games/door",
    },
    {
        number,
        id: 'b9a44e12number',
        gameName: 'Вгадай число',
        description: 'Кожен раз коли ви клікаєте на кнопку “спробувати”, з вашого балансу списується 5% від вашого початкового депозиту, программа генерує випадкове значення від 1 до 10,  якщо ваш варіaнт співпав з тим який згенерувала программа, то ви отримаєте вдесятеро більше ніж поставили, якщо ні то втрачаєте списані кошти з балансу.',
        img: number,
        path: "/games/number",
    },
    {
        coin,
        id: '68d886c3coin',
        gameName: 'Монетка',
        description: 'Кожен раз коли ви нажимаєте на орел чи решка, з вашого балансу списується 5% від вашого початкового депозиту, программа генерує випадкове значення, якщо ваш варіант співпав з тим який згенерувала программа, то ви подвоюєте ставку, якщо ні то втрачаєте списані кошти з балансу.',
        img: coin,
        path: "/games/coin",

    }
];